# GetLBItemFillBackColor

## Description
Gets the specified list browser item's fill background color.

```pascal
FUNCTION GetLBItemFillBackColor(
				dialogID       : LONGINT;
				componentID    : LONGINT;
				itemIndex      : INTEGER;
				subItemIndex   : INTEGER;
				VAR redIndex   : INTEGER;
				VAR greenIndex : INTEGER;
				VAR blueIndex  : INTEGER): BOOLEAN;
```

```python
def vs.GetLBItemFillBackColor(dialogID, componentID, itemIndex, subItemIndex):
    return (BOOLEAN, redIndex, greenIndex, blueIndex)
```

## Parameters
|Name|Type|Description|
|---|---|---|
|dialogID|LONGINT|id of the dialog that contains the list browser|
|componentID|LONGINT|id of the list browser control|
|itemIndex|INTEGER|the row index|
|subItemIndex|INTEGER|the column index|
|redIndex|INTEGER|the red component (0 - 255)|
|greenIndex|INTEGER|the green component (0 - 255)|
|blueIndex|INTEGER|the blue component (0 - 255)|

## Examples
```pascal
BEGIN
	bFlipTexture := GetLBItemFillBackColor(dialog,kFrntMltColBrowser,RowCount,2,OldRed,OldGreen,OldBlue);
	OldRed := (OldRed)*257;
	OldGreen := (OldGreen)*257;
	OldBlue := (OldBlue)*257;
	TempColorArray [RowCount+1].Red := OldRed;
```
```python
import vs

# Gets the specified list browser item's fill background color.
dialogID = 1
componentID = 2
itemIndex = 1
subItemIndex = 1

ok, redIndex, greenIndex, blueIndex = vs.GetLBItemFillBackColor(dialogID, componentID, itemIndex, subItemIndex)
vs.Message('GetLBItemFillBackColor returned: ' + str((ok, redIndex, greenIndex, blueIndex)))
```

## Version
Availability: from VectorWorks12.0

## Category
* Dialogs - Modern - Browser